{
    "introduction": {
        "title": "Introduction",
        "subsections": {
            "sub_intro1": {
                "title": "Overview",
                "content": [{"type": "text", 
                             "data": "The Deep DNAshape websever can be used for quickly checking 14 DNA shape features and 13 shape fluctuations for any sequences (one or many), using query tables pre-computed from <a href='https://www.biorxiv.org/content/10.1101/2023.10.22.563383v1.full.pdf'>Deep DNAshape</a> models. Compared to the deep learning model, using this webserver doesn't require downloading and installing tensorflow and running any codes. This web-server has pre-computed enough data from the Deep DNAshape model for instantaneously prediciton."},
                            {"type": "text",
                             "data": "The Deep DNAshape webserver is an updated version of previous popular DNAshape webserver used to predict DNA shape features given one or more sequences. The previous webserver can still be found at <a href='https://rohslab.cmb.usc.edu/DNAshape/'>Old DNAShape Webserver</a>."},
                            {"type": "text",
                             "data": "DNA shape features are derived DNA structural parameters for quantitatively analysis of DNA structures. For detail informaiton about DNA shape features, please take a look at this <a href='https://academic.oup.com/nar/article-abstract/45/22/12877/4634013'>paper</a>. DNA shape fluctuation measures how easy the static DNA shape can be spontaneuosly altered, which indicates DNA flexibility in DNA shape level. The web server is able to predict 14 DNA shape features, including 2 DNA groove features, 6 intra-base-pair features and 6 inter-base-pair features; 13 DNA shape fluctuation features, excluding EP-FL."},
                            {"type": "image", "data": "DNAshape_explain2.png", "alt": "DNA shape features"}]
            }
        }
    },
    "getting_started": {
        "title": "Getting Started",
        "subsections": {
            "sub_intro2": {
                "title": "Single sequence",
                "content": [{"type": "text", "data": "In the left text input box, input: "},
                            {"type": "text", "data": "ACGTCACGTGGTAG", "style": "dna-sequence"},
                            {"type": "image", "data": "first_example.PNG", "alt": "First example."},
                            {"type": "text", "data": "The right side will automatically have the DNA shape profile drawn."},
                            {"type": "image", "data": "first_example_shape.PNG", "alt": "The shape profile of the first example."},
                            {"type": "text", "data": "Now, we can edit the sequence by changing any position to another character from A, C, G, T and N. The right panel will reflect the change simultaneously. "}]
            },
            "sub_intro3": {
                "title": "Multiple sequences",
                "content": [{"type": "text", "data": "Now let's try an example with multiple sequences. In the left text input box, input more sequences (each sequence per line). "},
                            {"type": "text", "data": "For example:"},
                            {"type": "text", "data": "ACGTCACGTGGTAG\nACCTCACGTGATAG\nTTTTCACGTGCCAG\n", "style": "dna-sequence"},
                            {"type": "text", "data": "The right side will automatically have the DNA shape profile drawn with the same order of the input."},
                            {"type": "image", "data": "multiple_sequences_example_shape.PNG", "alt": "Multiple sequences example"},
                            {"type": "text", "data": "Now, we can further edit the sequence by changing any position to another character from A, C, G, T and N, or add more sequences to compare. The right panel will reflect the change simultaneously. "}]
            },
            "sub_intro4": {
                "title": "File Upload and Download",
                "content": [{"type": "text", "data": "Now let's try upload a text file containing a lot of DNA sequences. Create a .txt file with the following content: "},
                            {"type": "text", "data": "ACGTCACGTGGTAG\nACCTCACGTGATAG\nTTTTCACGTGCCAG\n", "style": "dna-sequence"},
                            {"type": "text", "data": "Now click 'upload' button and select the .txt file you just created. Hit the button 'Upload File & Download Predictions'."},
                            {"type": "text", "data": "After a couple seconds, your browser should start downloading the selected DNA shape feature predicted for the sequences in your .txt. You can now work on those DNA shape feature offline to suit your own needs."}]
            }
        }
    },
    "input_data": {
        "title": "Input Data Format",
        "subsections": {
            "sub_intro1": {
                "title": "Sequence Input",
                "content": [{"type": "text", 
                             "data": "Only these characters (case sensetive) are allowed: A C G T N"},
                             {"type": "text", 
                             "data": "Input any other characters will show a warning sign and the figure will not be updated."}
                           ]
            },
            "sub_intro2": {
                "title": "File Input",
                "content": [{"type": "text", "data": "If you want the server to directly predict a large file containing many sequences without showing you any figures, you can upload the .txt file."},
                            {"type": "text", "data": "The .txt file should contain DNA sequences with only the characters as shown above (ACGTN). Each line should contain one sequence. The maximum number of lines is 1,000,000. Files longer than 1,000,000 lines should use Deep DNAshape python package instead (<a href='https://github.com/JinsenLi/deepDNAshape/'>Deep DNAshape</a>). "}]
            }
        }
    },
    "parameter": {
        "title": "Advanced settings",
        "subsections": {
            "sub_intro1": {
                "title": "Layer Selection",
                "content": [{"type": "text", 
                             "data": "Users can select the shape layer values if they want to evaluate shorter or longer flanking influence. The shape layer number means how many base pairs does the model consider in the prediction on both of the 5' and 3' ends. For example, layer 4 means 9-mer query table for intra-base-pair features and groove features, and 10-mer query table for inter-base-pair features."},
                             {"type": "image", "data": "layer.jpg", "alt": "The purpose of selecting layers."}
                           ]
            },
            "sub_intro2": {
                "title": "Shape Features",
                "content": [{"type": "text", 
                             "data": "There are a lot of shape features this web server can predict. These shape features may sound complicated. For detailed understanding of these DNA shape features, refer to our <a href='https://academic.oup.com/nar/article-abstract/45/22/12877/4634013'>paper</a>."}
                            ]
            },
            "sub_intro3": {
                "title": "Shape Fluctuations",
                "content": [{"type": "text", 
                             "data": "DNA shape fluctuations can also be predicted using this webserver. Simply select the checkbox \"For shape fluctuation values, check this box.\" then the figure will be updated to include the fluctuation values as error bars."},
                            {"type": "text",
                             "data": "DNA shape fluctuation feature is not available for EP."}]
            }
        }
    },
    "vis_down": {
        "title": "Visualization and Downloading Data",
        "subsections": {
            "sub_intro0": {
                "title": "Plot style change",
                "content": [{"type": "text", 
                             "data": "The regular plot is a collection of line plots for multiple sequence. If you are analyzing a lot of sequences, line plots may not be a best option. Therefore, the plot style can be changed to boxplot by one-click a button 'Toggle plot type' on the top action bar."},
                            {"type": "image", 
                             "data": "style_change.PNG", "alt":""},
                            {"type": "text", 
                             "data": "After click the button 'Toggle plot type', the plot will be changed to the following boxplot style: "},
                            {"type": "image", 
                             "data": "box_plot.PNG", "alt":""}
                           ]
            },
            "sub_intro1": {
                "title": "Plot Customization",
                "content": [{"type": "text", 
                             "data": "Plot can be resized using the right bottom corner adjuster."},
                            {"type": "image", 
                             "data": "adjuster.PNG", "alt":""},
                            {"type": "text", 
                             "data": "Many components in the figure are adjustable. For example, the title, x-axis and y-axis labels are editable through double click and draggable. "},
                            {"type": "image", 
                             "data": "components.PNG", "alt":""},
                            {"type": "text", 
                             "data": "Color coding explanation for multiple sequences."}
                           ]
            },
            "sub_intro2": {
                "title": "Downloading Results",
                "content": [{"type": "text", "data": "If you'd like to save the generated figure, simply click the first button on the top action bar \"Download plot as a png\"."},
                {"type": "image", "data": "savefig.png", "alt": ""},
                {"type": "text", "data": "If you'd like to download all the predicted values and analyze them offline, simply click the button on the right side \"Download Data\". The server will return a .csv file for all the plotted data in the figure as the order of your input sequences."},
                {"type": "image", "data": "savedata.png", "alt": ""}]
            }
        }
    },
    "about": {
        "title": "About",
        "subsections": {
            "sub_intro1": {
                "title": "Development Team",
                "content": [{"type": "text", 
                             "data": "Rohs Lab @ USC"}
                           ]
            },
            "sub_intro2": {
                "title": "Version History",
                "content": [{"type": "text", "data": "v0.1. Release."}]
            }
        }
    }
}